{"Title":"Action for Children","Schedule":"N\/A","Description":"If families and relationships are strengthened, children who were previously on the edge of being placed in care are able to stay at home.  We work with each member of the family with all children in the household receive care and attention, and where necessary…","Address":"Poolstock Lane WIGAN WN3 5HL","Phone":"0300 123 2112","Email":"ask.us@actionforchildren.org.uk","Website":"https:\/\/www.actionforchildren.org.uk\/in-your-area\/services\/early-years-and-family-support\/intensive-family-support\/wigan-fip\/"}
{"Title":"Family mediation - helping resolve conflict and live better family lives","Schedule":"N\/A","Description":"All families experience conflict, sometimes a little extra help is needed to sort it out.  TalkFIRST is a chairty based in Ince providing mediation to families in Wigan, Leigh and the surrpounding areas to aid communication, resolve conflcit helping people feel heard and understood.  If…","Address":"Ashland House Dobson Park Way Wigan Lancashire WN2 2DX","Phone":"01942 243620","Email":"info@talkfirst.org","Website":"http:\/\/talkfirst.org\/"}
{"Title":"Family Rights Group","Schedule":"N\/A","Description":"Family Rights Group promotes policies and practices that keep children safe within their family and strengthen the family and community networks of those children who cannot live at home. We campaign for families to have their voice heard, be treated fairly and get help early to…","Address":"N\/A","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Leigh Life Centre","Schedule":"Mon to Fri - 10am to 2pm","Description":"Leigh Life Centre is based in Leigh Library and provides face-to-face information, help and advice about council services in the heart of the community. Please select the link below for more information including opening times.","Address":"Civic Square Market St Leigh LEIGH WN7 1EB","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Marsh Green Life Centre","Schedule":"Please select the link provided for opening times","Description":"Marsh Green Life Centre provides face-to-face information, help and advice about council services in the heart of the community.","Address":"Harrow Road Marsh Green WIGAN WN5 0QL","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Navigate: emotional support for parents (Scope)","Schedule":"Monday to Friday: 9am to 8pm Saturday: 9am to 12pm","Description":"Navigate is a national mentoring service, that provides online emotional support for parents and carers of disabled children who are finding out about their child’s additional needs.  Please visit their website provided for full information.","Address":"N\/A","Phone":"0808 801 0510","Email":"navigate@scope.org.uk","Website":"https:\/\/www.scope.org.uk\/navigate"}
{"Title":"PALS (Patient Advice and Liaison Service)","Schedule":"N\/A","Description":"The Patient Advice and Liaison Service (PALS) offers confidential advice, support and information on health-related matters. They provide a point of contact for patients, their families and their carers. How can PALS help? PALS provides help in many ways. For example, it can: help you with…","Address":"17 Beecham Court WIGAN WN3 6PR","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Special educational needs and disability - Local Offer","Schedule":"N\/A","Description":"The Local Offer is all the provision we expect to be available across education, health and social care for children and young people in Wigan Borough who have SEN or are disabled, including those who do not have Education, Health and Care (EHC) plans. Key…","Address":"Platt Bridge Community Zone 81 Ribble Road Platt Bridge Wigan WN2 5EG","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Stroke Association Wigan Stroke Recovery Service","Schedule":"Monday, Tuesday, Wednesday, Thursday and Friday","Description":"Wigan Stroke Recovery Service provides practical advice, emotional support and high-quality information following a stroke. Whether you are a stroke survivor, carer or family member, we will work with you to identify and address your physical needs through a personalised plan, and support you to…","Address":"WN5 9QX","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Support for Carers","Schedule":"N\/A","Description":"Please select the link provided for information on the following. What is a carer? How to get support Young carers Parent carers Carers Stories Useful support links and contact","Address":"WN2 3BD","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Support for Wigan Arrivals Project (SWAP)","Schedule":"N\/A","Description":"Support for Wigan Arrivals Project supports asylum seekers and refugees who are living in the Wigan Borough. Our vision is for everyone living in Wigan to feel welcome, to be given an equal chance to build a decent life, and to know where and how…","Address":"Penson Street Community Centre Penson Street WIGAN WN1 2LP","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Support services for 0-19's","Schedule":"N\/A","Description":"Start Well offer support, advice and guidance for young people aged 0-19 (or 25 if they have learning or additional needs) who are at level 3 on Wigan Safeguarding's Thresholds of Need. By addressing any concerns in a multi-agency way, with an early help assessment, we…","Address":"N\/A","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Wigan and Leigh People First","Schedule":"N\/A","Description":"Wigan & Leigh People First is a Self-Advocacy organisation for People with Learning Disabilities. We get involved in a range of local and regional events and consultations which we think could be part of making life better for people with learning disabilities. Established as a…","Address":"1-3 Heath Street Golborne Golborne Greater Manchester WA3 3BN","Phone":"N\/A","Email":"https:\/\/wlpf.org.uk\/","Website":"N\/A"}
{"Title":"Wigan Life Centre North","Schedule":"Mon - Fri  10am to 2pm","Description":"Wigan Life Centre offers a range of public services under one roof, in a modern, friendly environment.  We have specially trained staff on hand to provide information, help and advice on a range of services. For full information please select the link below.","Address":"The Wiend Wigan WN1 1NH","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Young people from different ethnic backgrounds","Schedule":"Tuesday's, 5pm - 7.30pm","Description":"If you’re aged 7-18 and have recently come to live in Wigan or Leigh from a different country, you can come and join us. There are two young people’s groups in the borough that are just for young people from different ethnic backgrounds. You can do…","Address":"N\/A","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
