{"Title":"BYOU","Schedule":"Please get in touch for details of where we meet.","Description":"Being young and LGBT, or not sure, can sometimes be difficult. Everyone has their own strengths and skills and you can draw on these to help you feel more confident about being yourself. Sometimes you will need some support from other people who have different strengths…","Address":"N\/A","Phone":"N\/A","Email":"https:\/\/www.wigan.gov.uk\/LINC2\/Have-a-say\/BYOU.aspx","Website":"N\/A"}
{"Title":"Children in Care","Schedule":"N\/A","Description":"Leaving Care - Advice and support for when you leave care. Council’s responsibilities - As a corporate parent for children in care we have certain responsibilities. Residential homes - Accommodation for young people that have emotional, attachment or behaviour difficulties. Independent reviews - Reviewing the needs…","Address":"WN3 4NW","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"Children in Care Activity Groups","Schedule":"N\/A","Description":"If you're in care and aged 7-12 (Junior) or 13-19 (Senior) you're welcome to come along to one of these groups in your local area. Junior groups offer activities such as archery, arts and crafts, cookery and games. The senior group gives you the chance to influence…","Address":"N\/A","Phone":"01942 487100","Email":"TYSSWeb@wigan.gov.uk","Website":"https:\/\/www.wigan.gov.uk\/LINC2\/Things-to-do\/Activities\/Children-in-Care-Activity-Groups.aspx"}
{"Title":"EDIT (Early Detection and Intervention Team)","Schedule":"N\/A","Description":"Early Detection and Intervention Team (EDIT) is a specialist psychological therapy service that works with young people aged 14 – 35 years who are experiencing distress and symptoms such as: Hearing or seeing things that others cannot Feeling paranoid or suspicious of people or certain…","Address":"Sale Way LEIGH WN7 4JY","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"FFLAG","Schedule":"Please contact for details","Description":"FFLAG is dedicated to supporting parents and their gay, lesbian and bisexual sons and daughters, helping parents understand, accept and support their family members with love and pride. Visit the webiste below for full information.","Address":"across the north west","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"LINC 2","Schedule":"N\/A","Description":"Find out about things to do, get information about issues that might affect you, find out about services that are here to support you and discover the latest opportunities for young people in Wigan and Leigh. Things to doFind activities for young people run by…","Address":"N\/A","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
{"Title":"We Are Explorers","Schedule":"Monday - Thursday and Saturdays","Description":"We Are Explorers is a youth organisation that supports queer and questioning young folx in the wider Leigh area. Our support includes: A free weekly youth group for queer and questioning 11-18 year olds. Additional provision is offered during school holidays. Free opportunities for queer…","Address":"Leigh Wigan WN7","Phone":"07598906411","Email":"jam.explorers@yahoo.com","Website":"https:\/\/www.weareexplorers.org"}
{"Title":"Wigan and Leigh Carers Centre (WLCC)","Schedule":"Open Monday to Friday from 9 am until 4.30 pm","Description":"Carers are at the heart of everything we do.  We care deeply about making it our mission to make a positive difference to the lives of both young and adult carers in the Wigan and Leigh Borough.   Are you an unpaid \/ unwaged Carer?…","Address":"3-5 Frederick Street Hindley Wigan Greater Manchester WN2 3BD","Phone":"01942 697885","Email":"info@wlcccarers.com","Website":"https:\/\/www.wlcccarers.com\/"}
{"Title":"Wigan and Leigh Young Carers","Schedule":"N\/A","Description":"Young carers and their families do not always know where to go for help. You may not have realised that your child is a young carer, as it’s just part of your family life, or you may have hit a crisis point and don’t know…","Address":"N\/A","Phone":"01942 697885","Email":"https:\/\/www.walyc.org.uk\/","Website":"N\/A"}
{"Title":"Wigan Youth Cabinet\/Wigan Youth Parliament","Schedule":"N\/A","Description":"If you want to change something that affects young people in Wigan Borough, the Youth Cabinet might be for you. They campaign to make things better for young people in Wigan. For more information and contact details please select the link provided Wigan and Leigh…","Address":"WIGAN WN1 1NJ","Phone":"01942 487100","Email":"TYSSWeb@wigan.gov.uk","Website":"https:\/\/www.wigan.gov.uk\/LINC2\/Have-a-say\/Youth-Cabinet.aspx"}
{"Title":"Young people from different ethnic backgrounds","Schedule":"Tuesday's, 5pm - 7.30pm","Description":"If you’re aged 7-18 and have recently come to live in Wigan or Leigh from a different country, you can come and join us. There are two young people’s groups in the borough that are just for young people from different ethnic backgrounds. You can do…","Address":"N\/A","Phone":"N\/A","Email":"N\/A","Website":"N\/A"}
